#### ReloadSwapOutInfo Members

---

|  |
| --- |
| ReloadSwapOutInfo Class   Methods   Properties   See Also |

The  ReloadSwapOutInfo  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Dispose | Releases all resources used by the  ReloadSwapOutInfo |
| Public method | Equals | Determines whether the specified  Object  is equal to the current  Object  . (Inherited from  Object  .) |
| Public method | GetHashCode | Serves as a hash function for a particular type. (Inherited from  Object  .) |
| Public method | GetType | Gets the  Type  of the current instance. (Inherited from  Object  .) |
| Public method | ToString | Returns a string that represents the current object. (Inherited from  Object  .) |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | CurrentVersion | New version. |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| Public property | Part | The ElementId of part being swapped. |
| Public property | PreviousVersion | Previous version. |
| Public property | WasSwapped | Whether the swap out was successful. |

# See Also

ReloadSwapOutInfo Class

Autodesk.Revit.DB Namespace